cavidade/icoFoam/Re-4030-CDS/m02/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Selecione o modelo de fluido Newtoniano
transportModel  Newtonian;

//Modifique o valor da viscosidade cinematica de acordo com o seu numero de Reynolds
nu              [0 2 -1 0 0 0 0] 2.5e-05;

// ************************************************************************* //
